// ==========================================
// 📦 词库模块：公告长难句 (dict_sentence.js)
// ==========================================
(window.TAIKO_SUB_DICTS = window.TAIKO_SUB_DICTS || []).push({
  // --- 20260806 字体变更通知 ---
  // 此部分翻译参照官方FB繁中版
  ゲーム内フォント変更のお知らせ: {
    "zh-CN": "游戏内字体变更通知",
    "zh-TW": "遊戲內字型變更通知",
  },
  "『太鼓の達人（ゲームセンター版）』にて使用しているフォントが一部新しくなります":
    {
      "zh-CN": "《太鼓之达人》电子游乐场版本的部分内容将使用新字体",
      "zh-TW": "《太鼓之達人》電子遊樂場版本的部分內容將使用新字型",
    },
  "今回のフォント変更に伴い、一部の表示やテキストの見え方が以前と異なる場合がございます":
    {
      "zh-CN": "随着本次变更字体，部分画面与文字显示方式将与以往不同",
      "zh-TW": "隨著本次變更字型，部分畫面與文字顯示方式將與以往不同",
    },
  "太鼓の達人らしさを考え抜いて選んだフォントであり、": {
    "zh-CN": "这是经过深思熟虑后精心选择的符合太鼓之达人风格的字体，",
    "zh-TW": "這是經過深思熟慮後精心選擇的符合太鼓之達人風格的字型，",
  },
  ゲームプレイに支障はございませんので安心してお楽しみください: {
    "zh-CN": "并不影响游玩，请各位玩家放心享受游戏",
    "zh-TW": "並不影響遊玩，請各位玩家放心享受遊戲",
  },

  "今後とも、『太鼓の達人（ゲームセンター版）』をよろしくお願いいたします": {
    "zh-CN": "今后也请大家一如既往的支持《太鼓之达人》电子游乐场版本",
    "zh-TW": "今後也請繼續支持《太鼓之達人》電子遊樂場版本",
  },

  "中国内地は、後日の楽曲収録を予定しています。": {
    "zh-CN": "中國內地預計於日後收錄樂曲。",
    "zh-TW": "中國內地預計於日後收錄樂曲。",
  },
  "後日の楽曲収録を予定しています。": { "zh-CN": "預計於日後收錄樂曲。" },
  "国や地域によって、一部の楽曲は収録されない場合があります。": {
    "zh-CN": "依地區或國家不同，可能不會收錄部分樂曲。",
  },
  "これによりワールドワイド(中国内地を除く)で、Bandai Namco PassportなどのアミューズメントICカードを使用できる時間が長くなります":
    {
      "zh-CN":
        "因此，全球范围内(中国内地除外)可使用Bandai Namco Passport等Amusement IC卡游玩的时间将有所延长",
    },

  // --- 歌曲使用终止 ---
  "上記楽曲のサヨナラを受けて、": { "zh-CN": "伴随上述歌曲使用终止，" },
  以下の対応を行います: { "zh-CN": "将采取以下对应措施" },
  以下をお知らせいたします: { "zh-CN": "进行以下通知" },
  "より、以下の楽曲がサヨナラ曲となり、期日以降のプレイが出来なくなります。": {
    "zh-CN": "起，以下歌曲使用终止，今后将无法游玩。",
  },
  "ドンだーひろばにて設定できる「お気に入り曲」および「大好きな曲」に該当のサヨナラ曲を設定していた場合、期日以降は未設定の状態になります。":
    {
      "zh-CN":
        "如果在鼓众广场中将这首歌曲设置为了「收藏歌曲」或「最喜欢的歌曲」，今后将变为未设置状态。",
    },
  "お気に入り曲・大好きな曲について】": {
    "zh-CN": "收藏歌曲・最喜欢的歌曲】",
  },
  お気に入り曲: { "zh-CN": "收藏歌曲" },
  大好きな曲: { "zh-CN": "最喜欢的歌曲" },
  "ドンだーひろばのマイメニューに表示される王冠・スコアランクの数が、今回のサヨナラ曲で獲得していた分を引いた状態になります。":
    {
      "zh-CN":
        "鼓众广场的我的菜单中显示的皇冠和等级数将扣除从这首歌曲中获得的数量。",
    },
  "王冠・スコアランクの数について】": { "zh-CN": "皇冠・等级数】" },
  "ドンだーひろばにて表示されている、獲得している王冠の数については、当分の間変更されることはありません。":
    {
      "zh-CN": "鼓众广场中显示已获得的皇冠数量，在近期内不会发生变更。",
    },
  "適宜タイミングで整理を行う予定となっております。": {
    "zh-CN": "计划在适当的时机进行整理。",
  },
  "獲得している王冠の数について】": {
    "zh-CN": "已获得的皇冠数量】",
  },
  "ドンだーひろばにて、該当のサヨナラ曲のスコア表示、ランキングの表示が行われなくなります。":
    {
      "zh-CN": "鼓众广场中将不再显示这首歌曲的得分和排行。",
    },
  "ドンだーひろばにて、該当のサヨナラ曲につきましてスコア表示、ランキングの表示が行われなくなります。":
    {
      "zh-CN": "鼓众广场中将不再显示这首歌曲的得分和排行。",
    },
  "スコア・ランキングについて】": { "zh-CN": "得分・排行】" },
  スコア: { "zh-CN": "得分" }, //Score
  ランキング: { "zh-CN": "排行" }, //Ranking
  "ドンだーひろばにて、該当のサヨナラ曲を含む大会・挑戦状の作成ができなくなります。":
    {
      "zh-CN": "鼓众广场中将无法创建包含这首歌曲的大会・挑戦状。",
    },
  "ドンだーひろばにて、該当のサヨナラ曲を含む大会/挑戦状の作成ができなくなります。":
    {
      "zh-CN": "鼓众广场中将无法创建包含这首歌曲的大会/挑戦状。",
    },
  "挑戦状・大会について】": { "zh-CN": "挑戦状・大会】" },
  "サヨナラまでの間に、対象の楽曲をお楽しみいただけますと幸いです。": {
    "zh-CN": "我们希望您在该歌曲终止使用前，可以去体验这首歌曲。",
  },
  "今後も太鼓の達人およびドンだーひろばをご愛顧賜りますよう何卒よろしくお願い致します。":
    {
      "zh-CN": "今后也请大家一如既往的支持太鼓之达人以及鼓众广场！",
    },
  "最新バージョンの『太鼓の達人（ゲームセンター版）』を、Bandai Namco Passport や対応ＩＣカードを使ってプレイするだけ":
    {
      "zh-CN":
        "只要使用Bandai Namco Passport或对应的ＩＣ卡游玩最新版本的《太鼓之达人（電子遊樂場版本）》即可",
    },

  // --- Blog 定型文 ---
  "ドンだーのみなさん、こんにちは": { "zh-CN": "各位鼓众，大家好" },
  "みなさん、こんにちは": { "zh-CN": "各位，大家好" },
  皆さんこんにちは: { "zh-CN": "大家好" },
  みなさんこんにちは: { "zh-CN": "大家好" },
  みなさん: { "zh-CN": "大家" },
  太鼓チームのエトウです: { "zh-CN": "我是太鼓Team的江藤" },
  エトウ: { "zh-CN": "江藤(エ\u200Bト\u200Bウ)" },
  お知らせ担当の１１号です: { "zh-CN": "我是通知担当１１号" },
  お知らせ担当の１１１号です: { "zh-CN": "我是通知担当１１１号" },
  久しぶりのお知らせ担当１１１号です: { "zh-CN": "我是久违的通知担当１１１号" },
  "それでは、お知らせスタート": { "zh-CN": "那么，通知正式开始" },
  "（パチパチパチパチ）": { "zh-CN": "（鼓掌）" },
  "ゲームセンター向け「太鼓の達人」のサヨナラ曲について": {
    "zh-CN": "电子游乐场版本「太鼓之达人」歌曲下架相关",
  },
  ゲームセンター版: { "zh-CN": "电子游乐场版本", "zh-TW": "電子遊樂場版本" },
  "ゲームセンター向け「太鼓の達人」": {
    "zh-CN": "电子游乐场版本「太鼓之达人」",
    "zh-TW": "電子遊樂場版本「太鼓之達人」",
  },
  スマートフォン向けアプリ: { "zh-CN": "智能手机应用程序" },
  アプリ: { "zh-CN": "App" },

  // --- XXX的通知 ---
  "ゲームセンター向け「太鼓の達人」のサヨナラ曲について": {
    "zh-CN": "电子游乐场版本「太鼓之达人」歌曲终止使用相关*",
  },
  サヨナラ曲のお知らせも: { "zh-CN": "以及歌曲下架通知" },
  サヨナラ曲のお知らせ: { "zh-CN": "歌曲下架通知" },
  サヨナラ曲に関するお知らせ: { "zh-CN": "歌曲下架相关的通知" },
  サヨナラ曲: { "zh-CN": "使用终止歌曲" },
  のお知らせ: { "zh-CN": "的通知" },
  に関するお知らせ: { "zh-CN": "相关的通知" },
  //お知らせ: { "zh-CN": "通知" },
});
